key = '1b269f8ec13069f9d609f7d5e6bd6554'
url = 'http://api.openweathermap.org/data/2.5/weather'
url_geo = 'http://api.openweathermap.org/geo/1.0/direct'

welcome_text = '\nЗдравствуйте!\n'\
               'Вы запустили консольное приложение для определения погоды.'

commands_list = '\nСписок команд:\n'\
                '1 - определить погоду в любом городе\n'\
                '2 - определить погоду в своём городе\n'\
                '3 - увидеть историю запросов\n'\
                '4 - удалить историю запросов\n'\
                '5 - завершить работу приложения\n'

city_enter = 'Введите название города: '

command_enter = '>>> '

timeout_error = 'Превышено время ожидания. Попробуйте позже.'

connection_error = 'Отсутствует связь с сервером. Проверьте подключение к сети.'

city_not_exist = 'В базе нет такого города, проверьте правильность написания.'

separator = '\n*****\n'

wrong_num = 'Количеством записи может быть только целым числом больше нуля.'

no_history = 'В истории нет записей.'

short_history = 'В истории нет столько записей. Показываю все, что есть:\n'

how_much_history = 'Сколько записей показать: '

bye_bye = '\nДо новых встреч!'

wrong_command = 'Неверная команда, внимательнее прочитайте список команд.'